In [ ]:
import pandas as pd # importing pandas

In [2]:
#loading csv file
data=pd.read_csv(r"D:\Programming\Data cleaning projects\student exam\Expanded_data_with_more_features.csv")
data.head(10)

,Unnamed: 0,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,0,female,NaN,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74
1,1,female,group C,some college,standard,NaN,married,sometimes,yes,0.0,NaN,5 - 10,69,90,88
2,2,female,group B,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91
3,3,male,group A,associate's degree,free/reduced,none,married,never,no,1.0,NaN,5 - 10,45,56,42
4,4,male,group C,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75
5,5,female,group B,associate's degree,standard,none,married,regularly,yes,1.0,school_bus,5 - 10,73,84,79
6,6,female,group B,some college,standard,completed,widowed,never,no,1.0,private,5 - 10,85,93,89
7,7,male,group B,some college,free/reduced,none,married,sometimes,yes,1.0,private,> 10,41,43,39
8,8,male,group D,high school,free/reduced,completed,single,sometimes,no,3.0,private,> 10,65,64,68
9,9,female,group B,high school,free/reduced,none,married,regularly,yes,NaN,private,< 5,37,59,50

In [ ]:
#Basic Analysis
data.shape

(30641, 15)

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30641 entries, 0 to 30640
Data columns (total 15 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           30641 non-null  int64
 1   Gender               30641 non-null  object
 2   EthnicGroup          28801 non-null  object
 3   ParentEduc           28796 non-null  object
 4   LunchType            30641 non-null  object
 5   TestPrep             28811 non-null  object
 6   ParentMaritalStatus  29451 non-null  object
 7   PracticeSport        30010 non-null  object
 8   IsFirstChild         29737 non-null  object
 9   NrSiblings           29069 non-null  float64
 10  TransportMeans       27507 non-null  object
 11  WklyStudyHours       29686 non-null  object
 12  MathScore            30641 non-null  int64
 13  ReadingScore         30641 non-null  int64
 14  WritingScore         30641 non-null  int64
dtypes: float64(1), int64(4), object(10)
memory usage: 3.5+ MB

In [5]:
data.isnull().sum()

Unnamed: 0                0
Gender                    0
EthnicGroup            1840
ParentEduc             1845
LunchType                 0
TestPrep               1830
ParentMaritalStatus    1190
PracticeSport           631
IsFirstChild            904
NrSiblings             1572
TransportMeans         3134
WklyStudyHours          955
MathScore                 0
ReadingScore              0
WritingScore              0
dtype: int64

In [6]:
data.describe()

         Unnamed: 0    NrSiblings     MathScore  ReadingScore  WritingScore
count  30641.000000  29069.000000  30641.000000  30641.000000  30641.000000
mean     499.556607      2.145894     66.558402     69.377533     68.418622
std      288.747894      1.458242     15.361616     14.758952     15.443525
min        0.000000      0.000000      0.000000     10.000000      4.000000
25%      249.000000      1.000000     56.000000     59.000000     58.000000
50%      500.000000      2.000000     67.000000     70.000000     69.000000
75%      750.000000      3.000000     78.000000     80.000000     79.000000
max      999.000000      7.000000    100.000000    100.000000    100.000000

In [ ]:
data=data.drop(columns=['Unnamed: 0']) #dropping unecessary column

In [8]:
data.head()

,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,female,NaN,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74
1,female,group C,some college,standard,NaN,married,sometimes,yes,0.0,NaN,5 - 10,69,90,88
2,female,group B,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91
3,male,group A,associate's degree,free/reduced,none,married,never,no,1.0,NaN,5 - 10,45,56,42
4,male,group C,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75

* Handling Null values

In [ ]:
data['EthnicGroup'].value_counts() #checking for inconsistent values

EthnicGroup
group C    9212
group D    7503
group B    5826
group E    4041
group A    2219
Name: count, dtype: int64

In [10]:
data['EthnicGroup'].isnull().sum()

1840

In [ ]:
data['EthnicGroup']=data['EthnicGroup'].fillna(data["EthnicGroup"].mode()[0]) #filling null values with most frequent value

In [12]:
data['EthnicGroup'].isnull().sum()

0

In [13]:
data.head()

,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,female,group C,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74
1,female,group C,some college,standard,NaN,married,sometimes,yes,0.0,NaN,5 - 10,69,90,88
2,female,group B,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91
3,male,group A,associate's degree,free/reduced,none,married,never,no,1.0,NaN,5 - 10,45,56,42
4,male,group C,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75

In [ ]:
data['ParentEduc'].value_counts() #checking for inconsistent values

ParentEduc
some college          6633
high school           5687
associate's degree    5550
some high school      5517
bachelor's degree     3386
master's degree       2023
Name: count, dtype: int64

In [ ]:
data['ParentEduc'].isnull().sum() #getting total null values

1845

In [ ]:
data['ParentEduc']=data['ParentEduc'].fillna(data["ParentEduc"].mode()[0]) #filling null values with most frequent value

In [ ]:
data['ParentEduc'].isnull().sum() #getting total null values

0

In [ ]:
data['TestPrep'].value_counts() #checking for inconsistent values

TestPrep
none         18856
completed     9955
Name: count, dtype: int64

In [ ]:
data['ParentMaritalStatus'].value_counts() #checking for inconsistent values

ParentMaritalStatus
married     16844
single       7097
divorced     4919
widowed       591
Name: count, dtype: int64

In [ ]:
data['PracticeSport'].value_counts() #checking for inconsistent values

PracticeSport
sometimes    15213
regularly    10793
never         4004
Name: count, dtype: int64

In [ ]:
data[['TestPrep','ParentMaritalStatus','PracticeSport']].isnull().sum() #getting total null values

TestPrep               1830
ParentMaritalStatus    1190
PracticeSport           631
dtype: int64

In [ ]:
#filling null values of multiple columns with most frequent values
col_to_fill=['TestPrep','ParentMaritalStatus','PracticeSport']
for col in col_to_fill:
    data[col]=data[col].fillna(data[col].mode()[0])

In [ ]:
data[['TestPrep','ParentMaritalStatus','PracticeSport']].isnull().sum() #getting total null values

TestPrep               0
ParentMaritalStatus    0
PracticeSport          0
dtype: int64

In [26]:
data.head()

,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,female,group C,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74
1,female,group C,some college,standard,none,married,sometimes,yes,0.0,NaN,5 - 10,69,90,88
2,female,group B,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91
3,male,group A,associate's degree,free/reduced,none,married,never,no,1.0,NaN,5 - 10,45,56,42
4,male,group C,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75

In [ ]:
data['IsFirstChild'].value_counts() #checking for inconsistent values

IsFirstChild
yes    19082
no     10655
Name: count, dtype: int64

In [ ]:
data['IsFirstChild'].isnull().sum() #getting total null values

904

In [ ]:
data['IsFirstChild']=data['IsFirstChild'].fillna(data["IsFirstChild"].mode()[0]) #filling null values with most frequent value

In [ ]:
data['IsFirstChild'].value_counts() #checking for inconsistent values

IsFirstChild
yes    19986
no     10655
Name: count, dtype: int64

In [ ]:
data['IsFirstChild'].isnull().sum() #getting total null values

0

In [ ]:
data['IsFirstChild'].unique() #checking for unique values in column

array(['yes', 'no'], dtype=object)

In [33]:
data['IsFirstChild']=data['IsFirstChild'].map({'yes':1,'no':0}) #mapping object to binary

In [52]:
data["IsFirstChild"].sample(5)

8986     1
17695    1
29330    0
16837    1
15223    0
Name: IsFirstChild, dtype: int64

In [35]:
data['IsFirstChild'].unique()

array([1, 0], dtype=int64)

In [ ]:
data['NrSiblings'].value_counts() #checking for inconsistent values

NrSiblings
1.0    8217
2.0    6790
3.0    6123
0.0    3085
4.0    2941
5.0    1320
6.0     302
7.0     291
Name: count, dtype: int64

In [ ]:
data['NrSiblings']=data['NrSiblings'].fillna(data['NrSiblings'].median()) #filling null values with median value

In [ ]:
data['NrSiblings'].isnull().sum() #getting total null values

0

In [39]:
data.head()

,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,female,group C,bachelor's degree,standard,none,married,regularly,1,3.0,school_bus,< 5,71,71,74
1,female,group C,some college,standard,none,married,sometimes,1,0.0,NaN,5 - 10,69,90,88
2,female,group B,master's degree,standard,none,single,sometimes,1,4.0,school_bus,< 5,87,93,91
3,male,group A,associate's degree,free/reduced,none,married,never,0,1.0,NaN,5 - 10,45,56,42
4,male,group C,some college,standard,none,married,sometimes,1,0.0,school_bus,5 - 10,76,78,75

In [ ]:
data['WklyStudyHours'].unique() #Getting unique values for inconsistencies analysis

array(['< 5', '5 - 10', '> 10', nan], dtype=object)

In [ ]:
data['WklyStudyHours'].value_counts() #checking for inconsistent values

WklyStudyHours
5 - 10    16246
< 5        8238
> 10       5202
Name: count, dtype: int64

In [ ]:
data['WklyStudyHours']=data['WklyStudyHours'].str.replace(" ","").str.lower() #stripping extra space

In [43]:
data['WklyStudyHours'].value_counts()

WklyStudyHours
5-10    16246
<5       8238
>10      5202
Name: count, dtype: int64

In [44]:
data['WklyStudyHours'].head()

0      <5
1    5-10
2      <5
3    5-10
4    5-10
Name: WklyStudyHours, dtype: object

In [45]:
data['WklyStudyHours']=data['WklyStudyHours'].map({'<5':2.5,'5-10':7.5,'>10':12.5}) #mapping values to ranges the values are averages of range

In [ ]:
data['WklyStudyHours'].value_counts() #checking changes values

WklyStudyHours
7.5     16246
2.5      8238
12.5     5202
Name: count, dtype: int64

In [ ]:
data['WklyStudyHours']=data['WklyStudyHours'].fillna(data['WklyStudyHours'].median()) #filling null values with median values

In [ ]:
data['WklyStudyHours'].isnull().sum() #getting total null values

0

In [ ]:
data['NrSiblings']=data['NrSiblings'].astype('int64') #converting object to integer dtype

In [50]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30641 entries, 0 to 30640
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Gender               30641 non-null  object
 1   EthnicGroup          30641 non-null  object
 2   ParentEduc           30641 non-null  object
 3   LunchType            30641 non-null  object
 4   TestPrep             30641 non-null  object
 5   ParentMaritalStatus  30641 non-null  object
 6   PracticeSport        30641 non-null  object
 7   IsFirstChild         30641 non-null  int64
 8   NrSiblings           30641 non-null  int64
 9   TransportMeans       27507 non-null  object
 10  WklyStudyHours       30641 non-null  float64
 11  MathScore            30641 non-null  int64
 12  ReadingScore         30641 non-null  int64
 13  WritingScore         30641 non-null  int64
dtypes: float64(1), int64(5), object(8)
memory usage: 3.3+ MB

In [ ]:
data['ReadingScore'].unique() #checking for outliers

array([ 71,  90,  93,  56,  78,  84,  43,  64,  59,  54,  52,  82,  73,
        53,  75,  89,  32,  42,  69,  76,  70,  72,  65,  87,  81,  91,
        60,  74,  55,  68,  45,  86,  41,  17,  39,  61,  58,  62,  37,
        51,  48,  25,  79,  50,  47,  38,  80,  34,  77,  46,  66,  67,
        92,  44,  88, 100,  63,  99,  83,  94,  57,  49,  36,  85,  40,
        28,  97,  23,  33,  98,  95,  31,  24,  29,  96,  35,  26,  21,
        30,  18,  15,  11,  20,  19,  16,  22,  27,  12,  10,  14],
      dtype=int64)

In [ ]:
data['MathScore'].unique() #checking for outliers

array([ 71,  69,  87,  45,  76,  73,  85,  41,  65,  37,  58,  40,  66,
        80,  48,  88,  18,  46,  50,  42,  74,  75,  70,  63,  56,  97,
        81,  51,  77,  53,  59,  60,  67,  82,  54,  33,  84,  52,  61,
         0,  39,  62,  64,  47,  44,  28,  49,  57,  27,  68,  79, 100,
        72,  98,  55,  90,  86,  89,  21,  96,  91,  99,  83,  35,  43,
        93,  78,  94,  36,  29,  23,  92,  26,  38,  95,  30,  32,   8,
        34,  31,  25,  22,  17,  20,  16,  19,  24,  15,  11,  12,  13,
         9,  10,   7,  14], dtype=int64)

In [ ]:
data['WritingScore'].unique() #checking for outliers

array([ 74,  88,  91,  42,  75,  79,  89,  39,  68,  50,  52,  43,  71,
        58,  78,  86,  28,  47,  63,  70,  51,  80,  76,  53,  65,  72,
        61,  66,  38,  82,  85,  60,  90,  69,  67,  55,  77,  48,  87,
        49,  10,  34,  59,  37,  57,  64,  54,  40,  21,  83,  73,  45,
        33,  36,  94,  62, 100,  99,  95,  56,  41,  27,  81,  98,  46,
        44,  19,  26,  31,  84,  97,  93,  96,  92,  15,  30,  32,  23,
        35,  29,  17,  25,  24,  20,   6,  22,  14,  18,  16,  12,   9,
        13,   4], dtype=int64)

In [ ]:
#stripping space in multiple columns
col_to_fill=['TestPrep','Gender','PracticeSport']
for col in col_to_fill:
    data[col]=data[col].str.strip().str.lower()

* Handling duplicate value

In [ ]:
data.duplicated().sum()

1

In [53]:
data=data.drop_duplicates()

In [54]:
data.duplicated().sum()

0

In [57]:
data.to_csv("D:\Programming\Data cleaning projects\student exam\Cleaned student exam data.csv",index=False)

<>:1: SyntaxWarning: invalid escape sequence '\P'
<>:1: SyntaxWarning: invalid escape sequence '\P'
C:\Users\kavad\AppData\Local\Temp\ipykernel_16636\2203810409.py:1: SyntaxWarning: invalid escape sequence '\P'
  data.to_csv("D:\Programming\Data cleaning projects\student exam\Cleaned student exam data.csv",index=False)